Revit 2027 API
ConduitSizeSettings.DoesConduitStandardTypeExist Method
 Checks if the specified conduit standard exist.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DoesConduitStandardTypeExist(
	string standardName
)
Public Function DoesConduitStandardTypeExist (
	standardName As String
) As Boolean
public:
bool DoesConduitStandardTypeExist(
	String^ standardName
)
member DoesConduitStandardTypeExist :
        standardName : string -> bool
Parameters
standardName String
 The conduit standard name.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace